IDEA StatiCa Open Model
BeamData.IsBearingMember Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Is beam bearing member
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool IsBearingMember { get; set; }
Public Property IsBearingMember As Boolean
	Get
	Set
public:
property bool IsBearingMember {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace